Mystfit/ESP32-BLE-CompositeHID/src/gamepad/dualsense_edge/DualSenseGamepadDevice.cpp
#include "DualsenseGamepadDevice.h"
#include "BleCompositeHID.h"
#include "DualsenseDescriptors.h"
#include "ArduinoDefines.h"
#include <cstddef>
#include <cstdint>
#include <functional>
#include <string.h>
#include "esp_mac.h"
#include "esp_cpu.h"
#if defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#define LOG_TAG "DualsenseEdgeGamepadDevice"
#else
#include "esp_bt_device.h"
#include "esp_bt_main.h"
#include "esp_log.h"
#include "esp_log_level.h"
static const char* LOG_TAG = "DualsenseEdgeGamepadDevice";
#endif

// The DUALSENSE_BUTTON_* masks live in a 20-bit logical button space. In the wire report the
// low nibble of buttons[0] is occupied by the 4-bit hat, so button bit 0 lands at combined
// bit 4 (= buttons[0] bit 4). These helpers apply the 4-bit shift when reading/writing.
static inline void buttons_set(uint8_t b[3], uint32_t mask)
{
    uint32_t shifted = mask << 4;
    b[0] |= (uint8_t)(shifted & 0xFF);
    b[1] |= (uint8_t)((shifted >> 8) & 0xFF);
    b[2] |= (uint8_t)((shifted >> 16) & 0xFF);
}
static inline void hat_set(uint8_t b[3], uint8_t dir)
{
    b[0] = (uint8_t)((b[0] & 0xF0) | (dir & 0x0F));
}

// ---- DualsenseEdgeGamepadCallbacks ----

DualsenseEdgeGamepadCallbacks::DualsenseEdgeGamepadCallbacks(DualsenseEdgeGamepadDevice* device)
    : _device(device)
{}

void DualsenseEdgeGamepadCallbacks::onWrite(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo)
{
    [[maybe_unused]] uint16_t handle = pCharacteristic->getHandle();
    const NimBLEAttValue& value = pCharacteristic->getValue();
    size_t len = value.size();

    if (len == 0) {
        ESP_LOGD(LOG_TAG, "*** onWrite handle=%d size=0 connHandle=%d ***",
            handle, connInfo.getConnHandle());
        return;
    }

    const uint8_t* data = value.data();
    [[maybe_unused]] const char* role = "unknown";
    if (_device) {
        if (pCharacteristic == _device->getOutputChar())        role = "OUTPUT-0x31";
        else if (pCharacteristic == _device->getCalibration())  role = "FEATURE-0x05";
        else if (pCharacteristic == _device->getPairingInfo())  role = "FEATURE-0x09";
        else if (pCharacteristic == _device->getFirmwareInfo()) role = "FEATURE-0x20";
        else if (pCharacteristic == _device->getBtPatchInfo())  role = "FEATURE-0x22";
    }
    ESP_LOGD(LOG_TAG, "*** onWrite: role=%s handle=%d size=%d connHandle=%d ***",
        role, handle, len, connInfo.getConnHandle());
    // Full hex dump so we can see exactly what the host is writing - critical
    // for confirming whether tools like DSX are sending output reports at all,
    // and for inspecting reserved regions we don't parse into named fields.
    ESP_LOG_BUFFER_HEX_LEVEL(LOG_TAG, data, len, ESP_LOG_DEBUG);

    if (len < 47) {
        ESP_LOGW(LOG_TAG, "Output report too small: %d bytes", len);
    }

    DualsenseGamepadOutputReportData outputData;
    if (len >= 47 && outputData.load(data, len)) {
        // Dispatch to component Signals
        if (outputData.hasRumble()) {
            _device->rumble().onRumble.fire(
                {outputData.weakMotor(), outputData.strongMotor()});
        }
        if (outputData.hasLightbar()) {
            _device->light().onColorChanged.fire(
                {outputData.lightbar_red, outputData.lightbar_green, outputData.lightbar_blue});
        }
        if (outputData.hasPlayerIndicator()) {
            _device->playerIndicator().onChanged.fire(outputData.player_leds);
        }
        if (outputData.hasLeftTriggerEffect()) {
            _device->leftTrigger().onEffect.fire(outputData.leftTrigger());
        }
        if (outputData.hasRightTriggerEffect()) {
            _device->rightTrigger().onEffect.fire(outputData.rightTrigger());
        }
        if (outputData.valid_flag0 & DS_OUT_FLAG0_SPEAKER_VOLUME) {
            _device->speaker().onVolumeChanged.fire(outputData.speaker_volume);
        }
        if (outputData.valid_flag0 & DS_OUT_FLAG0_MIC_VOLUME) {
            _device->microphone().onVolumeChanged.fire(outputData.mic_volume);
        }
        if (outputData.hasMicMuteLed()) {
            _device->microphone().onMuteChanged.fire(
                (outputData.mute_button_led & 0x01) != 0);
        }
    }
}

void DualsenseEdgeGamepadCallbacks::onRead(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo)
{
    [[maybe_unused]] uint16_t handle = pCharacteristic->getHandle();
    ESP_LOGD(LOG_TAG, "*** onRead handle=%d connHandle=%d ***", handle, connInfo.getConnHandle());
    // Populate feature reports on read so Steam gets valid data
    // This is called BEFORE the data is sent to the host
    _device->populateFeatureReportOnRead(pCharacteristic);
}

void DualsenseEdgeGamepadCallbacks::onSubscribe(NimBLECharacteristic* pCharacteristic, NimBLEConnInfo& connInfo, uint16_t subValue)
{
    [[maybe_unused]] uint16_t handle = pCharacteristic->getHandle();
    ESP_LOGD(LOG_TAG, "onSubscribe handle=%d sub=%d connHandle=%d", handle, subValue, connInfo.getConnHandle());
}

void DualsenseEdgeGamepadCallbacks::onStatus(NimBLECharacteristic* pCharacteristic, int code)
{
    ESP_LOGD(LOG_TAG, "onStatus handle=%d code=%d", pCharacteristic->getHandle(), code);
}

// ---- DualsenseEdgeGamepadDevice ----

DualsenseEdgeGamepadDevice::DualsenseEdgeGamepadDevice() :
    _inputReport{},
    _cross         (_inputReport.buttons, DUALSENSE_BUTTON_A),
    _circle        (_inputReport.buttons, DUALSENSE_BUTTON_B),
    _square        (_inputReport.buttons, DUALSENSE_BUTTON_X),
    _triangle      (_inputReport.buttons, DUALSENSE_BUTTON_Y),
    _l1            (_inputReport.buttons, DUALSENSE_BUTTON_LB),
    _r1            (_inputReport.buttons, DUALSENSE_BUTTON_RB),
    _select        (_inputReport.buttons, DUALSENSE_BUTTON_SELECT),
    _start         (_inputReport.buttons, DUALSENSE_BUTTON_START),
    _home          (_inputReport.buttons, DUALSENSE_BUTTON_MODE),
    _l3            (_inputReport.buttons, DUALSENSE_BUTTON_LS),
    _r3            (_inputReport.buttons, DUALSENSE_BUTTON_RS),
    _touchpadBtn   (_inputReport.buttons, DUALSENSE_BUTTON_TOUCHPAD),
    _share         (_inputReport.buttons, DUALSENSE_BUTTON_SHARE),
    _mute          (_inputReport.buttons, DUALSENSE_BUTTON_MUTE),
    _l4            (_inputReport.buttons, DUALSENSE_BUTTON_L4),
    _r4            (_inputReport.buttons, DUALSENSE_BUTTON_R4),
    _l5            (_inputReport.buttons, DUALSENSE_BUTTON_L5),
    _r5            (_inputReport.buttons, DUALSENSE_BUTTON_R5),
    _leftTrigger   (_inputReport.z),
    _rightTrigger  (_inputReport.rz),
    _leftStick  (_inputReport.x,  _inputReport.y,  DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX),
    _rightStick (_inputReport.rx, _inputReport.ry, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX),
    _dpad          (_inputReport.buttons),
    _battery       (_inputReport.status),
    _config      (new DualsenseEdgeControllerDeviceConfiguration()),
    _extra_input (nullptr),
    _minimalInput(nullptr),
    _callbacks   (nullptr),
    _calibration (nullptr),
    _firmwareInfo(nullptr),
    _pairingInfo (nullptr),
    _btPatchInfo (nullptr),
    m_pCrcTable  (nullptr)
{
    _inputReport.bt  = 0x01;  // BLE header: HasHID=1 (contains state data)
    _inputReport.x   = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.y   = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.rx  = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.ry  = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.seq = 0x20;
    hat_set(_inputReport.buttons, DUALSENSE_BUTTON_DPAD_NONE);
    _inputReport.touchpoint_0_contact = 0x80;
    _inputReport.touchpoint_1_contact = 0x80;
    _inputReport.timestamp = 0x7621DD40;
    _inputReport.status    = 0x0A;  // 100% battery, discharging
    // Controller at rest: ~1g on the axis facing down.
    _inputReport.accel_y   = -DUALSENSE_ACC_RES_PER_G;

