Mystfit/ESP32-BLE-CompositeHID/src/gamepad/dualsense_edge/DualSenseGamepadDevice.cpp
}

DualsenseEdgeGamepadDevice::DualsenseEdgeGamepadDevice(DualsenseEdgeControllerDeviceConfiguration* config) :
    _inputReport{},
    _cross         (_inputReport.buttons, DUALSENSE_BUTTON_A),
    _circle        (_inputReport.buttons, DUALSENSE_BUTTON_B),
    _square        (_inputReport.buttons, DUALSENSE_BUTTON_X),
    _triangle      (_inputReport.buttons, DUALSENSE_BUTTON_Y),
    _l1            (_inputReport.buttons, DUALSENSE_BUTTON_LB),
    _r1            (_inputReport.buttons, DUALSENSE_BUTTON_RB),
    _select        (_inputReport.buttons, DUALSENSE_BUTTON_SELECT),
    _start         (_inputReport.buttons, DUALSENSE_BUTTON_START),
    _home          (_inputReport.buttons, DUALSENSE_BUTTON_MODE),
    _l3            (_inputReport.buttons, DUALSENSE_BUTTON_LS),
    _r3            (_inputReport.buttons, DUALSENSE_BUTTON_RS),
    _touchpadBtn   (_inputReport.buttons, DUALSENSE_BUTTON_TOUCHPAD),
    _share         (_inputReport.buttons, DUALSENSE_BUTTON_SHARE),
    _mute          (_inputReport.buttons, DUALSENSE_BUTTON_MUTE),
    _l4            (_inputReport.buttons, DUALSENSE_BUTTON_L4),
    _r4            (_inputReport.buttons, DUALSENSE_BUTTON_R4),
    _l5            (_inputReport.buttons, DUALSENSE_BUTTON_L5),
    _r5            (_inputReport.buttons, DUALSENSE_BUTTON_R5),
    _leftTrigger   (_inputReport.z),
    _rightTrigger  (_inputReport.rz),
    _leftStick  (_inputReport.x,  _inputReport.y,  DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX),
    _rightStick (_inputReport.rx, _inputReport.ry, DUALSENSE_STICK_MIN, DUALSENSE_STICK_MAX),
    _dpad          (_inputReport.buttons),
    _battery       (_inputReport.status),
    _config      (config),
    _extra_input (nullptr),
    _minimalInput(nullptr),
    _callbacks   (nullptr),
    _calibration (nullptr),
    _firmwareInfo(nullptr),
    _pairingInfo (nullptr),
    _btPatchInfo (nullptr),
    m_pCrcTable  (nullptr)
{
    _inputReport.bt  = 0x01;  // BLE header: HasHID=1 (contains state data)
    _inputReport.x   = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.y   = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.rx  = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.ry  = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.seq = 0x20;
    hat_set(_inputReport.buttons, DUALSENSE_BUTTON_DPAD_NONE);
    _inputReport.touchpoint_0_contact = 0x80;
    _inputReport.touchpoint_1_contact = 0x80;
    _inputReport.timestamp = 0x7621DD40;
    _inputReport.status    = 0x0A;  // 100% battery, discharging
    // Controller at rest: ~1g on the axis facing down.
    _inputReport.accel_y   = -DUALSENSE_ACC_RES_PER_G;

}

DualsenseEdgeGamepadDevice::~DualsenseEdgeGamepadDevice()
{
    if (getOutput() && _callbacks) {
        getOutput()->setCallbacks(nullptr);
        delete _callbacks;
        _callbacks = nullptr;
    }
    if (_config)      { delete _config;      _config = nullptr; }
    if (m_pCrcTable)  { delete[] m_pCrcTable; m_pCrcTable = nullptr; }
}

void DualsenseEdgeGamepadDevice::init(NimBLEHIDDevice* hid)
{
    NimBLECharacteristic* input = hid->getInputReport(DUALSENSE_EDGE_INPUT_REPORT_ID);
    // Minimal Generic Desktop input report 0x01. Real DualSense exposes this
    // alongside 0x31 so Windows HIDClass activates the full input pipe.
    _minimalInput = hid->getInputReport(DUALSENSE_MINIMAL_INPUT_REPORT_ID);
    NimBLECharacteristic* output = hid->getOutputReport(DUALSENSE_EDGE_OUTPUT_REPORT_ID);
    _callbacks = new DualsenseEdgeGamepadCallbacks(this);

    input->setCallbacks(_callbacks);
    _minimalInput->setCallbacks(_callbacks);
    output->setCallbacks(_callbacks);

    _calibration  = hid->getFeatureReport(DUALSENSE_CALIBRATION_REPORT_ID);
    _calibration->setCallbacks(_callbacks);
    _firmwareInfo = hid->getFeatureReport(DUALSENSE_FIRMWARE_INFO_REPORT_ID);
    _firmwareInfo->setCallbacks(_callbacks);
    _pairingInfo  = hid->getFeatureReport(DUALSENSE_PAIRING_INFO_REPORT_ID);
    _pairingInfo->setCallbacks(_callbacks);
    _btPatchInfo  = hid->getFeatureReport(DUALSENSE_BT_PATCH_REPORT_ID);
    _btPatchInfo->setCallbacks(_callbacks);

    setCharacteristics(input, output);

    ESP_LOGI(LOG_TAG, "Characteristic handles: input=%d output=%d calibration=%d firmwareInfo=%d pairingInfo=%d",
        input->getHandle(), output->getHandle(), _calibration->getHandle(),
        _firmwareInfo->getHandle(), _pairingInfo->getHandle());

    m_pCrcTable = new uint32_t[256];
    generate_crc_table(m_pCrcTable);

    // Pre-populate feature reports so they're ready when host reads them
    // This is critical for Steam to recognize controller capabilities (vibration, etc.)
    ESP_LOGI(LOG_TAG, "Pre-populating feature reports...");

    uint8_t calibBuf[DUALSENSE_CALIBRATION_REPORT_SIZE] = {};
    buildFeatureReportWithCrc(DUALSENSE_CALIBRATION_REPORT_ID,
        DualsenseEdge_StockCalibration, DUALSENSE_CALIBRATION_REPORT_SIZE - 5,
        calibBuf, DUALSENSE_CALIBRATION_REPORT_SIZE);
    _calibration->setValue(calibBuf, DUALSENSE_CALIBRATION_REPORT_SIZE);

    uint8_t firmBuf[DUALSENSE_FIRMWARE_INFO_REPORT_SIZE] = {};
    buildFeatureReportWithCrc(DUALSENSE_FIRMWARE_INFO_REPORT_ID,
        DualsenseEdge_FirmwareInfo, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE - 5,
        firmBuf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
    _firmwareInfo->setValue(firmBuf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);

    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_BT);
    memcpy(_pairingReport.mac_address, mac, 6);
    memcpy(_pairingReport.common, (uint8_t*)&DualsenseEdge_PairInfo_common, 9);
    uint8_t pairHdr[] = { PS_FEATURE_CRC32_SEED, DUALSENSE_PAIRING_INFO_REPORT_ID };
    uint32_t pairCrc  = crc32_le(0xFFFFFFFF, pairHdr, sizeof(pairHdr));
    pairCrc = ~crc32_le(pairCrc, (uint8_t*)&_pairingReport, offsetof(DualsenseGamepadPairingReportdata, crc32));
    _pairingReport.crc32 = pairCrc;
    _pairingInfo->setValue((uint8_t*)&_pairingReport, DUALSENSE_PAIRING_INFO_REPORT_SIZE);

    // BT patch version (0x22) - zero-filled payload + CRC. DSX reads this during
    // handshake; if the characteristic doesn't exist or size mismatches, Windows
    // rejects the GATT read with Win32 error 87 and tears down the HID session.
    uint8_t btPatchBuf[DUALSENSE_BT_PATCH_REPORT_SIZE];
    uint8_t btPatchPayload[DUALSENSE_BT_PATCH_REPORT_SIZE - 4] = { 0 };
    buildFeatureReportWithCrc(DUALSENSE_BT_PATCH_REPORT_ID,
        btPatchPayload, sizeof(btPatchPayload),
        btPatchBuf, DUALSENSE_BT_PATCH_REPORT_SIZE);
    _btPatchInfo->setValue(btPatchBuf, DUALSENSE_BT_PATCH_REPORT_SIZE);

    // Minimal 0x01 input report default: sticks centered (0x80), hat = 8 (centered/null),
    // buttons = 0, triggers = 0. Layout: X,Y,Z,Rz, (hat+pad), btnLo, btnHi, Rx, Ry.
    uint8_t minimalDefault[DUALSENSE_MINIMAL_INPUT_REPORT_SIZE] = {
        0x80, 0x80, 0x80, 0x80,  // X, Y, Z, Rz (sticks centered)
        0x08,                     // hat = 8 (null) in low nibble, high nibble pad
        0x00, 0x00,              // 14 buttons + 6 bits padding
        0x00, 0x00               // Rx, Ry (triggers)
    };
    _minimalInput->setValue(minimalDefault, sizeof(minimalDefault));

    ESP_LOGI(LOG_TAG, "Feature reports pre-populated");
}

const BaseCompositeDeviceConfiguration* DualsenseEdgeGamepadDevice::getDeviceConfig() const
{
    return _config;
}

void DualsenseEdgeGamepadDevice::resetInputs()
{
    std::lock_guard<std::mutex> lock(_mutex);
    memset(&_inputReport, 0, sizeof(DualsenseGamepadInputReportData));
    _inputReport.bt    = 0x01;
    _inputReport.x     = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.y     = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.rx    = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.ry    = DUALSENSE_AXIS_CENTER_OFFSET;
    _inputReport.seq   = 0x20;
    hat_set(_inputReport.buttons, DUALSENSE_BUTTON_DPAD_NONE);
    _inputReport.touchpoint_0_contact = 0x80;
    _inputReport.touchpoint_1_contact = 0x80;
    _inputReport.timestamp = 0x7621DD40;
    _inputReport.status    = 0x0A;
    _inputReport.accel_y   = -DUALSENSE_ACC_RES_PER_G;
    _touchPointActive[0] = false;
    _touchPointActive[1] = false;
}

