Mystfit/ESP32-BLE-CompositeHID/src/gamepad/dualsense_edge/DualSenseGamepadDevice.cpp
int8_t DualsenseEdgeGamepadDevice::touchpadStartTouch(uint16_t x, uint16_t y)
{
    int8_t slotIndex = -1;
    {
        std::lock_guard<std::mutex> lock(_mutex);
        for (int i = 0; i < 2; i++) {
            if (!_touchPointActive[i]) { slotIndex = (int8_t)i; break; }
        }
        if (slotIndex < 0) return -1;

        _touchPointActive[slotIndex] = true;
        _touchPointId[slotIndex] = _nextTouchId;
        _nextTouchId = (_nextTouchId + 1) & 0x7F;

        // Contact byte: bit 7 = 0 (active), bits 0-6 = touch ID
        uint8_t contact = _touchPointId[slotIndex] & 0x7F;
        if (slotIndex == 0) {
            _inputReport.touchpoint_0_contact = contact;
            _inputReport.touchpoint_0_x = x & 0xFFF;
            _inputReport.touchpoint_0_y = y & 0xFFF;
        } else {
            _inputReport.touchpoint_1_contact = contact;
            _inputReport.touchpoint_1_x = x & 0xFFF;
            _inputReport.touchpoint_1_y = y & 0xFFF;
        }
    }
    if (_config->getAutoReport()) sendReport();
    return slotIndex;
}

void DualsenseEdgeGamepadDevice::touchpadUpdatePosition(uint16_t x, uint16_t y, uint8_t slotIndex)
{
    if (slotIndex >= 2) return;
    {
        std::lock_guard<std::mutex> lock(_mutex);
        if (!_touchPointActive[slotIndex]) return;
        if (slotIndex == 0) {
            _inputReport.touchpoint_0_x = x & 0xFFF;
            _inputReport.touchpoint_0_y = y & 0xFFF;
        } else {
            _inputReport.touchpoint_1_x = x & 0xFFF;
            _inputReport.touchpoint_1_y = y & 0xFFF;
        }
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::touchpadStopTouch(uint8_t slotIndex)
{
    if (slotIndex >= 2) return;
    {
        std::lock_guard<std::mutex> lock(_mutex);
        if (!_touchPointActive[slotIndex]) return;
        _touchPointActive[slotIndex] = false;
        if (slotIndex == 0) _inputReport.touchpoint_0_contact = 0x80;
        else                 _inputReport.touchpoint_1_contact = 0x80;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::setAccel(int16_t x, int16_t y, int16_t z)
{
    x = constrain(x, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);
    y = constrain(y, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);
    z = constrain(z, -DUALSENSE_ACC_RANGE, DUALSENSE_ACC_RANGE);
    {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.accel_x = x;
        _inputReport.accel_y = y;
        _inputReport.accel_z = z;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::setGyro(int16_t pitch, int16_t yaw, int16_t roll)
{
    {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.gyro_x = pitch;
        _inputReport.gyro_y = yaw;
        _inputReport.gyro_z = roll;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::timestamp()
{
    _inputReport.timestamp = esp_cpu_get_cycle_count() / 1500;
}

void DualsenseEdgeGamepadDevice::seq()
{
    if (_inputReport.seq < 254) _inputReport.seq++;
    else                         _inputReport.seq = 0;
    sendReport();
}

void DualsenseEdgeGamepadDevice::sendReport(bool defer)
{
    if (defer || _config->getAutoDefer()) {
        queueDeferredReport(std::bind(&DualsenseEdgeGamepadDevice::sendGamepadReportImpl, this));
    } else {
        sendGamepadReportImpl();
    }
}

void DualsenseEdgeGamepadDevice::sendFirmInfoReport(bool defer)
{
    if (defer || _config->getAutoDefer())
        queueDeferredReport(std::bind(&DualsenseEdgeGamepadDevice::sendFirmInfoReportImpl, this));
    else
        sendFirmInfoReportImpl();
}

void DualsenseEdgeGamepadDevice::sendCalibrationReport(bool defer)
{
    if (defer || _config->getAutoDefer())
        queueDeferredReport(std::bind(&DualsenseEdgeGamepadDevice::sendCalibrationReportImpl, this));
    else
        sendCalibrationReportImpl();
}

void DualsenseEdgeGamepadDevice::sendPairingInfoReport(bool defer)
{
    if (defer || _config->getAutoDefer())
        queueDeferredReport(std::bind(&DualsenseEdgeGamepadDevice::sendPairingInfoReportImpl, this));
    else
        sendPairingInfoReportImpl();
}

void DualsenseEdgeGamepadDevice::sendGamepadReportImpl()
{
    auto input = getInput();
    auto parentDevice = getParent();
    if (!input || !parentDevice || !parentDevice->isConnected())
        return;
    {
        std::lock_guard<std::mutex> lock(_mutex);
        uint8_t bthdr[] = { PS_INPUT_CRC32_SEED, DUALSENSE_EDGE_INPUT_REPORT_ID };
        uint32_t crc = crc32_le(0xFFFFFFFF, bthdr, sizeof(bthdr));
        crc = ~crc32_le(crc, (uint8_t*)&_inputReport, sizeof(_inputReport) - 4);
        _inputReport.crc32 = crc;
        ESP_LOGD(LOG_TAG, "Sending report size=%d crc=%lx", sizeof(_inputReport), crc);
        input->setValue((uint8_t*)&_inputReport, sizeof(_inputReport));
    }
    input->notify();
}

void DualsenseEdgeGamepadDevice::sendFirmInfoReportImpl()
{
    auto parentDevice = getParent();
    if (!_firmwareInfo || !parentDevice || !parentDevice->isConnected()) return;
    std::lock_guard<std::mutex> lock(_mutex);
    uint8_t buf[DUALSENSE_FIRMWARE_INFO_REPORT_SIZE] = {};
    buildFeatureReportWithCrc(DUALSENSE_FIRMWARE_INFO_REPORT_ID,
        DualsenseEdge_FirmwareInfo, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE - 5,
        buf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
    _firmwareInfo->setValue(buf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
    _firmwareInfo->indicate();
}

void DualsenseEdgeGamepadDevice::sendCalibrationReportImpl()
{
    auto parentDevice = getParent();
    if (!_calibration || !parentDevice || !parentDevice->isConnected()) return;
    std::lock_guard<std::mutex> lock(_mutex);
    uint8_t buf[DUALSENSE_CALIBRATION_REPORT_SIZE] = {};
    buildFeatureReportWithCrc(DUALSENSE_CALIBRATION_REPORT_ID,
        DualsenseEdge_StockCalibration, DUALSENSE_CALIBRATION_REPORT_SIZE - 5,
        buf, DUALSENSE_CALIBRATION_REPORT_SIZE);
    _calibration->setValue(buf, DUALSENSE_CALIBRATION_REPORT_SIZE);
    _calibration->indicate();
}

void DualsenseEdgeGamepadDevice::sendPairingInfoReportImpl()
{
    auto parentDevice = getParent();
    if (!_pairingInfo || !parentDevice || !parentDevice->isConnected()) return;
    std::lock_guard<std::mutex> lock(_mutex);
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_BT);
    memcpy(_pairingReport.mac_address, mac, 6);
    memcpy(_pairingReport.common, (uint8_t*)&DualsenseEdge_PairInfo_common, 9);
    uint8_t bthdr[] = { PS_FEATURE_CRC32_SEED, DUALSENSE_PAIRING_INFO_REPORT_ID };
    uint32_t crc = crc32_le(0xFFFFFFFF, bthdr, sizeof(bthdr));
    crc = ~crc32_le(crc, (uint8_t*)&_pairingReport, offsetof(DualsenseGamepadPairingReportdata, crc32));
    _pairingReport.crc32 = crc;
    _pairingInfo->setValue((uint8_t*)&_pairingReport, DUALSENSE_PAIRING_INFO_REPORT_SIZE);
    _pairingInfo->indicate();
}

static uint8_t setStatusBit(uint8_t current, uint8_t mask, bool value)
{
    return value ? (current | mask) : (current & ~mask);
}

void DualsenseEdgeGamepadDevice::setL2TriggerFeedback(uint8_t effectFlags, uint8_t position, uint8_t reserved)
{
    {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.l2_trigger_feedback[0] = effectFlags;
        _inputReport.l2_trigger_feedback[1] = position;
        _inputReport.l2_trigger_feedback[2] = reserved;
    }
    if (_config->getAutoReport()) sendReport();
}

