Mystfit/ESP32-BLE-CompositeHID/src/gamepad/dualsense_edge/DualSenseGamepadDevice.cpp
void DualsenseEdgeGamepadDevice::setR2TriggerFeedback(uint8_t effectFlags, uint8_t position, uint8_t reserved)
{
    {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.r2_trigger_feedback[0] = effectFlags;
        _inputReport.r2_trigger_feedback[1] = position;
        _inputReport.r2_trigger_feedback[2] = reserved;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::setHeadphonesPlugged(bool plugged)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_HEADPHONES_PLUGGED, plugged);
    if (_inputReport.status2 != newStatus2) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.status2 = newStatus2;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::setHeadphoneMic(bool connected)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_HEADPHONE_MIC, connected);
    if (_inputReport.status2 != newStatus2) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.status2 = newStatus2;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::setMuteActive(bool active)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_MUTE_ACTIVE, active);
    if (_inputReport.status2 != newStatus2) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.status2 = newStatus2;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::setUsbPlugged(bool plugged)
{
    uint8_t newStatus2 = setStatusBit(_inputReport.status2, DUALSENSE_STATUS2_USB_PLUGGED, plugged);
    if (_inputReport.status2 != newStatus2) {
        std::lock_guard<std::mutex> lock(_mutex);
        _inputReport.status2 = newStatus2;
    }
    if (_config->getAutoReport()) sendReport();
}

void DualsenseEdgeGamepadDevice::buildFeatureReportWithCrc(
    uint8_t reportId, const uint8_t* payload, size_t payloadSize,
    uint8_t* outBuffer, size_t outSize)
{
    if (outSize < payloadSize + 4) return;
    memcpy(outBuffer, payload, payloadSize);
    uint8_t hdr[] = { PS_FEATURE_CRC32_SEED, reportId };
    uint32_t crc = crc32_le(0xFFFFFFFF, hdr, sizeof(hdr));
    crc = ~crc32_le(crc, outBuffer, payloadSize);
    outBuffer[payloadSize + 0] = (uint8_t)( crc        & 0xFF);
    outBuffer[payloadSize + 1] = (uint8_t)((crc >>  8) & 0xFF);
    outBuffer[payloadSize + 2] = (uint8_t)((crc >> 16) & 0xFF);
    outBuffer[payloadSize + 3] = (uint8_t)((crc >> 24) & 0xFF);
}

void DualsenseEdgeGamepadDevice::populateFeatureReportOnRead(NimBLECharacteristic* pCharacteristic)
{
    ESP_LOGD(LOG_TAG, "populateFeatureReportOnRead pChar=%p", (void*)pCharacteristic);

    if (pCharacteristic == getOutput()) {
        ESP_LOGI(LOG_TAG, "Host reading output report — providing default");
        // Return a valid but empty output report (DS_OUTPUT_REPORT_BT_SIZE bytes for BLE format)
        static uint8_t defaultOut[DS_OUTPUT_REPORT_BT_SIZE] = {0};
        defaultOut[0] = 0x31;  // Report ID
        defaultOut[2] = 0x10;  // Tag (DS_OUTPUT_TAG)
        std::lock_guard<std::mutex> lock(_mutex);
        pCharacteristic->setValue(defaultOut, DS_OUTPUT_REPORT_BT_SIZE);
    } else if (pCharacteristic == _calibration) {
        ESP_LOGD(LOG_TAG, "Host reading calibration");
        {
            std::lock_guard<std::mutex> lock(_mutex);
            uint8_t buf[DUALSENSE_CALIBRATION_REPORT_SIZE] = {};
            buildFeatureReportWithCrc(DUALSENSE_CALIBRATION_REPORT_ID,
                DualsenseEdge_StockCalibration, DUALSENSE_CALIBRATION_REPORT_SIZE - 5,
                buf, DUALSENSE_CALIBRATION_REPORT_SIZE);
            pCharacteristic->setValue(buf, DUALSENSE_CALIBRATION_REPORT_SIZE);
        }
        // When calibration is read, also send an input report with valid sensor data
        // This helps Steam associate the calibration with valid gyro/accel readings
        sendGamepadReportImpl();
    } else if (pCharacteristic == _firmwareInfo) {
        ESP_LOGI(LOG_TAG, "Host reading firmware info");
        std::lock_guard<std::mutex> lock(_mutex);
        uint8_t buf[DUALSENSE_FIRMWARE_INFO_REPORT_SIZE] = {};
        buildFeatureReportWithCrc(DUALSENSE_FIRMWARE_INFO_REPORT_ID,
            DualsenseEdge_FirmwareInfo, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE - 5,
            buf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
        pCharacteristic->setValue(buf, DUALSENSE_FIRMWARE_INFO_REPORT_SIZE);
    } else if (pCharacteristic == _pairingInfo) {
        ESP_LOGI(LOG_TAG, "Host reading pairing info");
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_BT);
        memcpy(_pairingReport.mac_address, mac, 6);
        memcpy(_pairingReport.common, (uint8_t*)&DualsenseEdge_PairInfo_common, 9);
        uint8_t bthdr[] = { PS_FEATURE_CRC32_SEED, DUALSENSE_PAIRING_INFO_REPORT_ID };
        uint32_t crc = crc32_le(0xFFFFFFFF, bthdr, sizeof(bthdr));
        crc = ~crc32_le(crc, (uint8_t*)&_pairingReport, offsetof(DualsenseGamepadPairingReportdata, crc32));
        _pairingReport.crc32 = crc;
        std::lock_guard<std::mutex> lock(_mutex);
        pCharacteristic->setValue((uint8_t*)&_pairingReport, DUALSENSE_PAIRING_INFO_REPORT_SIZE);
    } else if (pCharacteristic == _btPatchInfo) {
        ESP_LOGI(LOG_TAG, "Host reading BT patch info");
        std::lock_guard<std::mutex> lock(_mutex);
        uint8_t buf[DUALSENSE_BT_PATCH_REPORT_SIZE];
        uint8_t payload[DUALSENSE_BT_PATCH_REPORT_SIZE - 4] = { 0 };
        buildFeatureReportWithCrc(DUALSENSE_BT_PATCH_REPORT_ID,
            payload, sizeof(payload), buf, DUALSENSE_BT_PATCH_REPORT_SIZE);
        pCharacteristic->setValue(buf, DUALSENSE_BT_PATCH_REPORT_SIZE);
    }
}

uint32_t DualsenseEdgeGamepadDevice::crc32_le(unsigned int crc, unsigned char const* buf, unsigned int len)
{
    for (unsigned int i = 0; i < len; i++)
        crc = m_pCrcTable[(crc ^ buf[i]) & 0xFF] ^ (crc >> 8);
    return crc;
}

void DualsenseEdgeGamepadDevice::generate_crc_table(uint32_t* crcTable)
{
    const uint32_t POLYNOMIAL = 0xEDB88320; // 0x04C11DB7 reversed
    uint8_t b = 0;
    do {
        uint32_t remainder = b;
        for (unsigned long bit = 8; bit > 0; --bit)
            remainder = (remainder & 1) ? (remainder >> 1) ^ POLYNOMIAL : (remainder >> 1);
        crcTable[(size_t)b] = remainder;
    } while (0 != ++b);
}
